<script setup>
import {onMounted} from "vue";

onMounted(() => {
  window.scrollTo({
    top: 0,
    left: 0,
    behavior: "smooth",
  })
})
</script>

<template>
  <div class="about">
    <div class="about_academy">
      <div class="header-container">
        <img
            class="header-icon"
            src="@/assets/icons/academy-cap.png" alt="academy">
        <p class="header-text">Деятельность академии</p>
      </div>

      <div class="about_academy__top-info">
        <img
            class="about_academy__image"
            src="@/assets/icons/logo.png" alt="academy"
        >
        <p class="plain-text">Региональная общественная организация по реализации программ в сфере экологии
          «Новосибирская экологическая
          академия», создана в форме общественной организации, является основанным на членстве общественным
          объединением, созданным по инициативе граждан Российской Федерации, в частности: ученых и специалистов,
          работающих в областях экологии, объединившихся на основе единства интересов для реализации общих целей.
        </p>
      </div>
    </div>

    <p class="header-text">Цели академии: </p>
    <ol>
      <li class="plain-text">содействие в разработке стратегии гармонического экологического развития</li>
      <li class="plain-text">участие в фундаментальных и прикладных исследованиях в области экологии</li>
      <li class="plain-text">содействие формирования социально-экологической политики, обеспечивающей рационализацию и
        оптимизацию взаимоотношений человека, общества и биосферы
      </li>
      <li class="plain-text">участие в формировании международной экологической стратегии развития</li>
    </ol>


    <div class="about_history">
      <div class="header-container">
        <img
            class="header-icon"
            src="@/assets/icons/academy-cap.png" alt="academy">
        <p class="header-text">История Создания</p>
      </div>
      <p class="plain-text">Региональная общественная организация по реализации программ в сфере экологии «Новосибирская
        экологическая академия», (ранее Новосибирское региональное отделение Российской экологической академии НРО РЭА)
        создана в 1993 году, как автономное юридическое лицо в виде общественной организации, по поручению первого
        Президента Российской экологической академии, академика РАН, Героя социалистического труда и Лауреата
        государственных премии СССР Яншина Леонида Александровича.
      </p>
      <p class="plain-text">Непосредственное участия в выполнение поручения по созданию Регионального отделения и
        организации первых экологических исследований в Новосибирской области приняли заведующий кафедрой Новосибирского
        института геодезии и картографии (НИГАиК) , доктор исторических наук Осипов Алексей Григорьевич и имеющий прежде
        должность ректора НИГАиК( в настоящий период СГГА) Лесных Иван Васильевич.
      </p>
      <p class="plain-text">Осипов А.Г. возглавил деятельность НРО РЭА на посту президента Регионального отделения и
        совместно с академиком НРО РЭА Лесных И.В. собрали под эгидой Регионального отделения круг
        ученых-единомышленников с целью решения серьезных экологических проблем г. Новосибирска и области. Для решения
        насущных проблем экологии в регионе к работе в научных секциях Отделения были привлечены доктора наук Середович
        В.Н., Жарников Б.Н., Маликов Б.Н., Колодкин М. и другие представители науки Новосибирской области.
      </p>
      <p class="plain-text">За период с 1995 года НРО РЭА выполнила значимые экологические исследования по защите
        окружающей среды и выявления негативного воздействия патогенных факторов на население г. Новосибирска и области.
        Применяя новые методы исследования патогенных зон на территории г. Новосибирска впервые была составлена,
        экологическая карта города с конкретных расчетом негативных факторов от воздействия загрязнения воздуха
        промышленными объектами, автомобильным и железнодорожным транспортом, геотектоническими разломами и различными
        видами электромагнитного излучения.
      </p>
      <p class="plain-text">Применяя методы картографического проектирования разработаны практические рекомендации для
        автотранспортных производственных предприятий по уменьшению выбросов выхлопных газов автотранспорта на 20-30%
        отдельных участках дорожной сети г. Новосибирска.
      </p>
      <p class="plain-text">В начале 2000-х годов, использование методов комплексирования, с учетом факторов вида
        растительности, температуры и влажности, дало возможность готовить сезонные карты зараженности местности
        клещевым энцефалитом, являющимся серьезной проблемой и угрозой здоровью населения Новосибирской области и Сибири
        в целом.
      </p>
      <p class="plain-text">Для решения проблемы технологических аварий и безопасной эксплуатации сложных энергетических
        объектов НРО РЭА были предложены к применению разработанные в лабораториях Сибирской государственной
        геологической академии, под руководством членов Регионального отделения, уникальные технологии трехмерного
        лазерного сканирования энергетического оборудования. Применение методов сканирования рекомендовано к
        практическому использованию в нефтегазовой отрасли для защиты хрупкой экосистемы северных регионов.
      </p>
      <p class="plain-text">Возникающие трудности в процессе практического внедрения научных исследований по
        экологическим проблемам привели к идеи создания производственной базы, под руководством НРО РЭА, на территории
        научного центра Сибирского отделения РАСХН. При участие сотрудников производственной базы НРО РЭА в 50
        километров от Новосибирска, в прибрежной рекреационной зоне Обского водохранилища был организован Экопарк
        «Боровое», как экологически чистая территория с развитой инфраструктурой для организации отдыха, развития
        экологического движения и проживания в лесопарковой зоне на берегу водохранилища.
      </p>
      <p class="plain-text">В целях решения вопросов экологии сложных систем, в 2023 году уже в рамках РОО
        «Новосибирской экологической академии» был создан и приступил к работе «Новосибирский институт системных
        исследований». РОО «НЭА», совместно с НИСИ провели сложную аэрокосмическую экспертизу земель Убинского района
        Новосибирской области в целях определения экологического состояния земель района и установления категорий земель
        пригодных под сельхозпроизводство.
      </p>
      <p class="plain-text">Членами РОО «НЭА» в период 2019-2024 г. были осуществлены мероприятия по развитию
        материально-технической базы Академии с целью созданию опытно-исследовательских площадок на удаленных от
        промышленных центров территориях. На настоящий период созданы две опытные площадки, одна из которых расположена
        в горнолесном массиве Чемальского района Республики Алтай, а вторая - в Маслянинском районе Новосибирской
        области.
      </p>
      <p class="plain-text">Деятельность Региональной общественной организации по реализации программ в сфере экологии
        «Новосибирская экологическая академия» постоянно осуществляется в соответствии с заявленными целями и видами
        деятельности общественной экологической организации направленные на разработку стратегии гармонического
        экологического развития, участие в фундаментальных и прикладных исследованиях в области экологии.
      </p>
      <p class="plain-text">Всемерное содействие формированию социально-экологической политики, обеспечивающей
        рационализацию и оптимизацию взаимоотношений человека, общества и биосферы; участие в формировании международной
        экологической стратегии развития.
      </p>
      <p class="plain-text"></p>
    </div>

    <p class="header-text">Основными задачами Академии за весь период деятельности являлись: </p>
    <ol>
      <li class="plain-text">поддержка наиболее значимых и перспективных научных исследований, а также отдельных ученых
        и научно-производственных коллективов, ведущих комплексные экологические разработки;
      </li>
      <li class="plain-text">участие в общественной экспертизе научных разработок в области экологии, а также
        хозяйственных проектов и программ в оценке их возможных воздействий на локальную и региональную экологическую
        ситуацию;
      </li>
      <li class="plain-text">содействие публикациям и популяризации результатов исследований в области экологии;</li>
      <li class="plain-text">всемерное содействие развитию сети учебных и научно-исследовательских учреждений с целью
        совершенствования всей системы социально-экологического образования и подготовки высококвалифицированных
        специалистов.
      </li>
    </ol>

  </div>
</template>


<style lang="scss">
@import "@/assets/styles/main";

.about {
  display: flex;
  flex-direction: column;
  justify-content: center;
  gap: 3rem;
  padding: 20% 2rem;

  &_academy {
    display: flex;
    flex-direction: column;
    gap: 2rem;

    &__top-info {
      display: flex;
      gap: 3rem;
      align-items: center;
    }

    &__image {
      width: 30%;
    }
  }

  &_history {
    display: flex;
    flex-direction: column;
    gap: 2rem;
  }

  &_employees {
    &__employees {
      padding: 2rem;
      display: flex;
      gap: 2rem;

      &_photo {
        width: 30%;
      }

      &_info {
        width: 60%;
        display: flex;
        flex-direction: column;
        gap: 1rem;
      }
    }
  }
}

@media (min-width: 500px) {
  .about {
    gap: 3rem;
    padding: 16% 5rem;
  }
}

@media (min-width: 992px) {
  .about {
    gap: 4rem;
    padding: 12% 10%;

    &_academy__image {
      width: 20%;
    }
  }
}

@media (min-width: 1200px) {
  .about {
    gap: 5rem;
    padding: 10rem 15%;

    &_employees {
      &__employees {
        padding: 2rem;
        display: flex;
        gap: 15rem;
        height: 20%;

        &_photo {
          width: 30%;
        }

        &_info {
          display: flex;
          flex-direction: column;
          gap: 1rem;
        }
      }
    }
  }
}

@media (min-width: 1500px) {
  .about {
    gap: 5rem;
    padding: 12rem 15%;

    &_academy__image {
      width: 10%;
    }

    &_employees {
      &__employees {
        padding: 2rem;
        display: flex;
        gap: 15rem;
        height: 20%;

        &_photo {
          width: 30%;
        }

        &_info {
          display: flex;
          flex-direction: column;
          gap: 1rem;
        }
      }
    }
  }
}
</style>